{
  "_name_or_path": "micro_llama",
  "architectures": [
    "LlamaForCausalLM"
  ],
  "attention_bias": false,
  "bos_token_id": 2,
  "eos_token_id": 1,
  "hidden_act": "silu",
  "hidden_size": 512,
  "initializer_range": 0.041666666666666664,
  "intermediate_size": 1408,
  "max_position_embeddings": 1024,
  "model_type": "llama",
  "num_attention_heads": 8,
  "num_hidden_layers": 6,
  "num_key_value_heads": 4,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "use_cache": true,
  "vocab_size": 256000
}
